# 6. Продолжить работу над вторым заданием. Реализуйте механизм валидации вводимых пользователем данных.
# Например, для указания количества принтеров,
# отправленных на склад, нельзя использовать строковый тип данных.
# Подсказка: постарайтесь по возможности реализовать в проекте «Склад оргтехники» максимум возможностей,
# изученных на уроках по ООП.

### В пред задании реализовал вохмоность добавлять и удалять технику на складе через классы.
# Пользователь вообще не может укзать количство, ему нужно укзать именно объекты классов Принтер, Сканер или Ксерокс.